RT-Thread/rt-thread/bsp/stm32h743-nucleo/Libraries/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_adc_ex.c
    if (sConfigInjected->InjecOversamplingMode == ENABLE)
    {
      assert_param(IS_ADC_OVERSAMPLING_RATIO(sConfigInjected->InjecOversampling.Ratio));
      assert_param(IS_ADC_RIGHT_BIT_SHIFT(sConfigInjected->InjecOversampling.RightBitShift));

      /*  JOVSE must be reset in case of triggered regular mode  */
      assert_param(!(READ_BIT(hadc->Instance->CFGR2, ADC_CFGR2_ROVSE|ADC_CFGR2_TROVS) == (ADC_CFGR2_ROVSE|ADC_CFGR2_TROVS)));

      /* Configuration of Injected Oversampler:                                 */
      /*  - Oversampling Ratio                                                  */
      /*  - Right bit shift                                                     */
      /*  - Left  bit shift                                                     */

      /* Enable OverSampling mode */

      MODIFY_REG(hadc->Instance->CFGR2, ADC_CFGR2_INJ_FIELDS,
                                        ADC_CFGR2_JOVSE                          |
                                        sConfigInjected->InjecOversampling.Ratio |
                                        sConfigInjected->InjecOversampling.RightBitShift);
    }
    else
    {
      /* Disable Regular OverSampling */
       CLEAR_BIT( hadc->Instance->CFGR2, ADC_CFGR2_JOVSE);
    }
     /* Set the LeftShift parameter: it is applied to the final result with or without oversampling */
     MODIFY_REG(hadc->Instance->CFGR2, ADC_CFGR2_LSHIFT, sConfigInjected->InjectedLeftBitShift);

    /* Sampling time configuration of the selected channel */
    /* if ADC_Channel_10 ... ADC_Channel_18 is selected */
    if (sConfigInjected->InjectedChannel >= ADC_CHANNEL_10)
    {
      /* Clear the old sample time and set the new one */
      MODIFY_REG(hadc->Instance->SMPR2,
          ADC_SMPR2(ADC_SMPR2_SMP10, sConfigInjected->InjectedChannel),
          ADC_SMPR2(sConfigInjected->InjectedSamplingTime, sConfigInjected->InjectedChannel));
    }
    else /* if ADC_Channel_0 ... ADC_Channel_9 is selected */
    {
      /* Clear the old sample time and set the new one */
      MODIFY_REG(hadc->Instance->SMPR1,
          ADC_SMPR1(ADC_SMPR1_SMP0, sConfigInjected->InjectedChannel),
          ADC_SMPR1(sConfigInjected->InjectedSamplingTime, sConfigInjected->InjectedChannel));
    }


    /* Configure the offset: offset enable/disable, channel, offset value */

    /* Shift the offset in function of the selected ADC resolution. */
    /* Offset has to be left-aligned on bit 15, the LSB (right bits) are set to 0 */
    tmpOffsetShifted = ADC_OFFSET_SHIFT_RESOLUTION(hadc, sConfigInjected->InjectedOffset);

    switch (sConfigInjected->InjectedOffsetNumber)
    {
      case ADC_OFFSET_1:
        /* Configure offset register 1:                                         */
        /* - Enable offset                                                      */
        /* - Set channel number                                                 */
        /* - Set offset value                                                   */
        MODIFY_REG(hadc->Instance->OFR1,
                  ADC_OFR1_OFFSET1 | ADC_OFR1_OFFSET1_CH,
                  ADC_OFR_CHANNEL(sConfigInjected->InjectedChannel) | tmpOffsetShifted);
        MODIFY_REG(hadc->Instance->CFGR2, ADC_CFGR2_RSHIFT1, sConfigInjected-> InjectedOffsetRightShift);
        /* Enable or disable the signed saturation bit */
        if(sConfigInjected->InjectedOffsetSignedSaturation != DISABLE)
        {
          SET_BIT(hadc->Instance->OFR1, ADC_OFR1_SSATE);
        }
        else
        {
          CLEAR_BIT(hadc->Instance->OFR1, ADC_OFR1_SSATE);
        }
        break;
      
      case ADC_OFFSET_2:
        /* Configure offset register 2:                                         */
        /* - Enable offset                                                      */
        /* - Set channel number                                                 */
        /* - Set offset value                                                   */
        /* - Set Right shift after offset application                           */
        MODIFY_REG(hadc->Instance->OFR2,
                  ADC_OFR2_OFFSET2 | ADC_OFR2_OFFSET2_CH,
                  ADC_OFR_CHANNEL(sConfigInjected->InjectedChannel) | tmpOffsetShifted);
         MODIFY_REG(hadc->Instance->CFGR2, ADC_CFGR2_RSHIFT2, sConfigInjected-> InjectedOffsetRightShift<<1);
        /* Enable or disable the signed saturation bit */
        if(sConfigInjected->InjectedOffsetSignedSaturation != DISABLE)
        {
          SET_BIT(hadc->Instance->OFR2, ADC_OFR2_SSATE);
        }
        else
        {
          CLEAR_BIT(hadc->Instance->OFR2, ADC_OFR2_SSATE);
        }
        break;
      
      case ADC_OFFSET_3:
        /* Configure offset register 3:                                         */
        /* - Enable offset                                                      */
        /* - Set channel number                                                 */
        /* - Set offset value                                                   */
        /* - Set Right shift after offset application                           */
        MODIFY_REG(hadc->Instance->OFR3,
                  ADC_OFR3_OFFSET3 | ADC_OFR3_OFFSET3_CH,
                  ADC_OFR_CHANNEL(sConfigInjected->InjectedChannel) | tmpOffsetShifted);
        MODIFY_REG(hadc->Instance->CFGR2, ADC_CFGR2_RSHIFT3, sConfigInjected-> InjectedOffsetRightShift<<2);
        /* Enable or disable the signed saturation bit */
        if(sConfigInjected->InjectedOffsetSignedSaturation != DISABLE)
        {
          SET_BIT(hadc->Instance->OFR3, ADC_OFR3_SSATE);
        }
        else
        {
          CLEAR_BIT(hadc->Instance->OFR3, ADC_OFR3_SSATE);
        }
        break;
      
      case ADC_OFFSET_4:
        /* Configure offset register 1:                                         */
        /* - Enable offset                                                      */
        /* - Set channel number                                                 */
        /* - Set offset value                                                   */
        MODIFY_REG(hadc->Instance->OFR4,
                  ADC_OFR4_OFFSET4 | ADC_OFR4_OFFSET4_CH,
                  ADC_OFR_CHANNEL(sConfigInjected->InjectedChannel) | tmpOffsetShifted);
        MODIFY_REG(hadc->Instance->CFGR2, ADC_CFGR2_RSHIFT4, sConfigInjected-> InjectedOffsetRightShift<<3);
        /* Enable or disable the signed saturation bit */
        if(sConfigInjected->InjectedOffsetSignedSaturation != DISABLE)
        {
          SET_BIT(hadc->Instance->OFR4, ADC_OFR4_SSATE);
        }
        else
        {
          CLEAR_BIT(hadc->Instance->OFR4, ADC_OFR4_SSATE);
        }
        break;
      
      /* Case ADC_OFFSET_NONE */
      default :
        break;
    }

  } /* if (ADC_IS_CONVERSION_ONGOING_REGULAR_INJECTED(hadc) == RESET) */


  /* Parameters update conditioned to ADC state:                              */
  /* Parameters that can be updated only when ADC is disabled:                */
  /*  - Single or differential mode                                           */
  /*  - Internal measurement channels: Vbat/VrefInt/TempSensor                */
  if (ADC_IS_ENABLE(hadc) == RESET)
  {
    /* Configuration of differential mode */
    if (sConfigInjected->InjectedSingleDiff != ADC_DIFFERENTIAL_ENDED)
    {
      /* Disable differential mode (default mode: single-ended) */
      CLEAR_BIT(hadc->Instance->DIFSEL, ADC_DIFSEL_CHANNEL(sConfigInjected->InjectedChannel));
    }
    else
    {
      /* Enable differential mode */
      SET_BIT(hadc->Instance->DIFSEL, ADC_DIFSEL_CHANNEL(sConfigInjected->InjectedChannel));

      /* Sampling time configuration of channel ADC_IN+1 (negative input) */
      /* For channels 9 to 15 for ADC1, ADC2, 9 to 11 for ADC3 */
      if (sConfigInjected->InjectedChannel >= ADC_CHANNEL_9)
      {
        /* Clear the old sample time and set the new one */
        MODIFY_REG(hadc->Instance->SMPR2,
                ADC_SMPR2(ADC_SMPR2_SMP10, sConfigInjected->InjectedChannel +1),
                ADC_SMPR2(sConfigInjected->InjectedSamplingTime, sConfigInjected->InjectedChannel +1));
      }
      else /* For channels 0 to 8 */
      {
         /* Clear the old sample time and set the new one */
        MODIFY_REG(hadc->Instance->SMPR1,
            ADC_SMPR1(ADC_SMPR1_SMP0, sConfigInjected->InjectedChannel +1),
             ADC_SMPR1(sConfigInjected->InjectedSamplingTime, sConfigInjected->InjectedChannel +1));
      }
    }


